// 这是一行注释信息
// 这是第二行注释
// 第一行的第三个单词必须和文件名完全一样，大小写也一样
// public class后面代表一个类名称，类是Java当中所有源代码的基本组织单位。
public class Demo00HelloWorld { 
  //下面一行的内容是万年不变的固定写法，代表main方法
  // 这一行代表程序运行的起点
	public static void main(String[] args) {
    // 这一行代表打印输出语句（屏幕显示）
		System.out.println("Hello world");
	}
}

 /* 没有换行，也叫多行注释*/
  /*
    多行注释（区块注释）
    多行注释
    多行注释
  */

/* 关键字：被保留的、有特殊含义的、不能随意适用的字符
     关键字特点：1、全部小写；2、有特殊颜色（如当前的紫色）
     pubic class static void都是关键字，HelloWorld是标识符
     标识符命名规则：
        1、包含英文字母大小写 0-9 $ _ 
        2、不能以数字开头
        3、不能是关键字
      标识符命名规范：
        1、类名：大驼峰式
        2、方法、变量：小驼峰式
  */ 

